{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"day:0": {"name": "day:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "meantemperature:0": {"name": "meantemperature:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "month:0": {"name": "month:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "totalrain:0": {"name": "totalrain:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "totalsnow:0": {"name": "totalsnow:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"dense_23": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_21/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_22/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_23/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/concatenate_11/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_11/dense_22/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/dense_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/dense_23/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_11/dense_23/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "day", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "meantemperature", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "month", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "totalrain", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "totalsnow", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "StatefulPartitionedCall/model_11/integer_lookup_29/Cast", "op": "Cast", "input": ["day"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_21/sub", "op": "Sub", "input": ["meantemperature", "unknown_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/integer_lookup_28/Cast", "op": "Cast", "input": ["month"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_22/sub", "op": "Sub", "input": ["totalrain", "unknown_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_23/sub", "op": "Sub", "input": ["totalsnow", "unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/integer_lookup_29/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "StatefulPartitionedCall/model_11/integer_lookup_29/Cast", "unknown_0"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_INT64"}, "Tout": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_21/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_11/normalization_21/sub", "ConstantFolding/StatefulPartitionedCall/model_11/normalization_21/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_1", "StatefulPartitionedCall/model_11/integer_lookup_28/Cast", "unknown_2"], "attr": {"Tout": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_22/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_11/normalization_22/sub", "ConstantFolding/StatefulPartitionedCall/model_11/normalization_22/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/normalization_23/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_11/normalization_23/sub", "ConstantFolding/StatefulPartitionedCall/model_11/normalization_23/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Size", "op": "Size", "input": ["StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/maxlength", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/minlength", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Greater/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/add/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const_1", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert", "op": "NoOp", "input": ["^StatefulPartitionedCall/model_11/integer_lookup_29/None_Lookup/LookupTableFindV2", "^StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/Size", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Greater/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/maxlength", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/minlength", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Size", "op": "Size", "input": ["StatefulPartitionedCall/model_11/integer_lookup_29/None_Lookup/LookupTableFindV2", "^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Greater/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/add/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const_1", "op": "Const", "input": ["^StatefulPartitionedCall/model_11/category_encoding_29/Assert/Assert"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/Greater"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/Max", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/add/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/Size", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Greater/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_11/integer_lookup_29/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/Cast", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/add"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/Greater"], "attr": {"DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/Max", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/add/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/minlength", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/Cast", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/add"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/model_11/category_encoding_28/bincount/maxlength", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Maximum"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/minlength", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/DenseBincount", "op": "DenseBincount", "input": ["StatefulPartitionedCall/model_11/integer_lookup_28/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Minimum", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const_1"], "attr": {"Tidx": {"type": "DT_INT64"}, "binary_output": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/model_11/category_encoding_29/bincount/maxlength", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Maximum"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/DenseBincount", "op": "DenseBincount", "input": ["StatefulPartitionedCall/model_11/integer_lookup_29/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Minimum", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT64"}, "binary_output": {"b": true}}}, {"name": "StatefulPartitionedCall/model_11/concatenate_11/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_11/normalization_21/truediv", "StatefulPartitionedCall/model_11/normalization_22/truediv", "StatefulPartitionedCall/model_11/normalization_23/truediv", "StatefulPartitionedCall/model_11/category_encoding_28/bincount/DenseBincount", "StatefulPartitionedCall/model_11/category_encoding_29/bincount/DenseBincount", "StatefulPartitionedCall/model_11/concatenate_11/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/model_11/dense_22/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_11/concatenate_11/concat", "StatefulPartitionedCall/model_11/dense_22/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_11/dense_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_11/dense_23/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_11/dense_22/Relu", "StatefulPartitionedCall/model_11/dense_23/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_11/dense_23/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_11/dense_23/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_3", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_21/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_5", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_22/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_7", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_11/normalization_23/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_0", "shape": [], "dtype": "int32"}, {"name": "unknown_2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/concatenate_11/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/dense_22/MatMul/ReadVariableOp", "shape": [13, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_11/dense_22/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_11/dense_23/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_11/dense_23/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/maxlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/minlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Greater/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_28/bincount/Const_1", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/maxlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/minlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Greater/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_11/category_encoding_29/bincount/Const_1", "shape": [0], "dtype": "float32"}]}]}